// ╔════════════════════════════════════════════════════════════════════════════╗
// ║                             Programm-Structure                             ║
// ╚════════════════════════════════════════════════════════════════════════════╝
//
// Структура программы

// Библиотека для ввода и вывода инфы
#include <iostream>

// Подключение пространства имён std.
// Без него нужно так std::cout << "" << std::endl;
using namespace std;

// Стартовой точкой программы является функция main.
// без неё никак. Иногда у функции могут быть аргументы
// int main (int argc, char *argv[]) 
int main()
{
  cout << "lol" << endl;
  return 0;
}



// ╔════════════════════════════════════════════════════════════════════════════╗
// ║                     Variables-Constants-and-datatypes                      ║
// ╚════════════════════════════════════════════════════════════════════════════╝
//
// Переменные и типы данных


